import os

# ==========================================
# Telegram
# ==========================================

BOT_TOKEN = os.environ.get("BOT_TOKEN", "")
CHAT_ID = os.environ.get("CHAT_ID", "")

# ==========================================
# Scanner
# ==========================================

SCAN_INTERVAL = int(
    os.environ.get("SCAN_INTERVAL", "60")
)

# ==========================================
# Bybit
# ==========================================

BASE_URL = "https://api.bybit.com"

# ==========================================
# Pump / Dump
# ==========================================

PUMP_PERCENT = 8.0
DUMP_PERCENT = -8.0

UNUSUAL_MOVE_PERCENT = 6.0
FOMO_PERCENT = 12.0

# ==========================================
# رشد از کف
# ==========================================

MIN_RISE_FROM_LOW = 3.0

# درصد مسیر طی شده تا مقاومت
MIN_EXTENSION_PERCENT = 60.0

# =========================================